app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(micropost_params)
    @micropost.image.attach(params[:micropost][:image])
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "sdasdsadasd"], ["user_id", 1], ["created_at", "2020-10-21 10:34:27.216847"], ["updated_at", "2020-10-21 10:34:27.216847"]]

  def destroy
    if @micropost.destroy
---
DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 2]]