app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.paginate(page: params[:page])

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "[DN_intern_Ruby] Huynh Quoc Viet"], ["email", "vietpro.huynhh@gmail.com"], ["created_at", "2020-10-21 10:24:28.111736"], ["updated_at", "2020-10-21 10:24:28.111736"]]
---
  def create
    @user = User.new user_params
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def load_user
    @user = User.find_by id: params[:id]